index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>BDD + NOTES</title>
<!-- 2015-06-04 Thu 21:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Peter Moresi" />
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="http://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">BDD + NOTES</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Overview</a></li>
<li><a href="#sec-2">Tools</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>BDD + NOTES</b> is a software development methodology that combines two methodologies:
</p>

<ol class="org-ol">
<li>Software specified through <i>concrete examples</i> written for automated test execution with a <b>Behavior Driven Development (BDD)</b> test framework.
</li>

<li>Software created as <i>notes</i> that describe the program logic in a natural language for human understanding and makes use of a <b>Literate Programming</b> toolchain.
</li>
</ol>

<p>
BDD and Literate Programming are used together to create a better solution then when either methodology is used alone.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Tools</h2>
<div class="outline-text-2" id="text-2">
<p>
There are many tools for BDD and literate programming. It is important that you pick the best one for yourself based on your needs.
</p>

<p>
The combination that I typically use is:
</p>

<ul class="org-ul">
<li><a href="http://cucumber.io">Cucumber</a> with <a href="http://ruby-lang.org">Ruby</a>
</li>
<li><a href="http://org-mode.org">Org-Mode</a> with whatever gets the job done with the best quality in least time
</li>
</ul>

<p>
Org-Mode is a powerful tool for literate programming with a huge impact on your workflow. The learning curve is steep. You will love it or hate it.
</p>

<p>
The quick and dirty literate programming style used by docco and friends is great when you want to augment your workflow and not completely replace it. The
large number or ports means that you will probably be able to find one for your programming language.
</p>

<ol class="org-ol">
<li>C# Programmers

<ul class="org-ul">
<li><a href="http://specflow.org">Specflow</a> with C# or <a href="http://www.fitnesse.org/">Fitnesse</a> with .Net fit
</li>
<li><a href="https://github.com/dontangg/nocco">nocco</a> with C#
</li>
</ul>
</li>

<li>Clojure/Java Programmers

<ul class="org-ul">
<li><a href="http://www.fitnesse.org/">Fitnesse</a> with Java
</li>
<li><a href="https://github.com/gdeer81/marginalia">Marginalia</a> with Clojure
</li>
</ul>
</li>

<li>Rails Programmers

<ul class="org-ul">
<li><a href="http://cucumber.io">Cucumber</a> with <a href="http://ruby-lang.org">Ruby</a>
</li>
<li><a href="https://github.com/rtomayko/rocco">Rocco</a> with Ruby
</li>
</ul>
</li>

<li>Front-end or Node.js Programmers

<ul class="org-ul">
<li><a href="http://www.fitnesse.org/">Fitnesse</a> with Coffeescript
</li>
<li><a href="http://jashkenas.github.io/docco/">Docco</a> with Coffeescript
</li>
</ul>
</li>

<li>PHP Programmers

<ul class="org-ul">
<li><a href="http://www.fitnesse.org/">Fitnesse</a> with PHP
</li>
<li><a href="http://jquery-jkit.com/sourcemakeup/">sourceMakeup</a> with PHP
</li>
</ul>
</li>
</ol>


<p>
I wish you success building software with <b>BDD + NOTES</b>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peter Moresi</p>
<p class="date">Created: 2015-06-04 Thu 21:26</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
